In [1]:
import pandas as pd
import numpy as np

---
**1.Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place.  Fill  in  these  missing  numbers  and  make  the  column  an  integer  column (instead of a float column).**

In [2]:
df = pd.DataFrame({
        'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
        'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
        'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
        'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']
})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.columns

Index(['From_To', 'FlightNumber', 'RecentDelays', 'Airline'], dtype='object')

In [5]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [6]:
k=0
for i in df['FlightNumber']:
    if i != i: # Check for NaN
        df['FlightNumber'][k]=df['FlightNumber'][k-1]+10
    else:
        df['FlightNumber'][k]=df['FlightNumber'][k]
    k+=1
df

C:\Users\imsub\anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\imsub\anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
# Converting to type int
df['FlightNumber']=df['FlightNumber'].astype('int')
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

---
**2.The  From_To  column  would  be  better  as  two  separate  columns!  Split  each string on the underscore delimiter _ to give a new temporary DataFrame with the  correct  values.  Assign  the  correct  column  names  to  this  temporary DataFrame.**

In [8]:
From=[]
To=[]
for i in df['From_To']:
    x,y = i.split('_')
    From.append(x)
    To.append(y)
df['From']=pd.Series(From)
df['To']=pd.Series(To)
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [9]:
df_temp = df.drop(columns='From_To')

In [10]:
df_temp

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

---
**3.Notice  how  the  capitalisation  of  the  city  names  is  all  mixed  up  in  this temporary  DataFrame.  Standardise  the  strings  so  that  only  the  first  letter  is uppercase (e.g. "londON" should become "London".)**

In [11]:
for i in range(len(df)):
    df_temp['From'][i]=df_temp['From'][i].capitalize()
    df_temp['To'][i]=df_temp['To'][i].capitalize()

C:\Users\imsub\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\imsub\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [12]:
df_temp

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

---
**4.Delete the From_To column from df and attach the temporary DataFrame from the previous questions**

In [13]:
df=df_temp
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

---

**5. In   the   RecentDelays   column,  the   values   have  been   entered   into   the DataFrame  as  a  list.  We  would  like  each  first  value  in  its  own  column,  each 
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [14]:
# finding number of extra columns to be added
m=0
for i in df['RecentDelays']:
    m=max(m,len(i))
m

3

In [15]:
# creating list of srrings : delay_1, delay_2, delay_3 ... delay_m 
# where m in no. of columns to be added
col=[]
for i in range(1,m+1):
    col.append("delay_"+str(i))

In [16]:
# Adding elements from all columns to a list
lis=[]
for i in df['RecentDelays']:
    lis.append(i)
# Filling null when no element in present 
for i in lis:
    for k in range(m-len(i)):
        i.append(np.nan)
lis

[[23, 47, nan], [nan, nan, nan], [24, 43, 87], [13, nan, nan], [67, 32, nan]]

In [17]:
unzipd=list(zip(*lis))
unzipd

[(23, nan, 24, 13, 67), (47, nan, 43, nan, 32), (nan, nan, 87, nan, nan)]

In [18]:
for i,j in enumerate(unzipd):
    df[i]=pd.Series(j)
df

,FlightNumber,RecentDelays,Airline,From,To,0,1,2
0,10045,"[23, 47, nan]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,"[nan, nan, nan]",<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,"[13, nan, nan]",12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32, nan]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [19]:
df.drop(columns='RecentDelays',inplace=True)
for i,j in enumerate(col):
    df[j]=df[i]
    df.drop(columns=i,inplace=True)
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN